0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kInlet          0.1;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInlet;

boundaryField
{
    inletWater
    {
        type            fixedValue;
        value           uniform $kInlet;
    }

    outletWater
    {
        type            inletOutlet;
        inletValue      uniform $kInlet;
        value           uniform $kInlet;
    }

    inletAir
    {
        type            fixedValue;
        value           uniform $kInlet;
    }

    outletAir
    {
        type            inletOutlet;
        inletValue      uniform $kInlet;
        value           uniform $kInlet;
    }

    lowerWall
    {
        type            kqRWallFunction;
        value           uniform $kInlet;
    }

    atmosphere
    {
	type		inletOutlet;
	inletValue	uniform $kInlet;
	value		uniform $kInlet;	
    }

    front
    {
	type		empty;
    }
    back
    {
	type		empty;
    }
    
#includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
